{
    "Компонент": "Component",
    "Перевод": "Translation",
    "ОБО МНЕ": "ABOUT ME",
    "ПРОЕКТЫ": "PROJECTS",
    "НАВЫКИ": "SKILLS",
    "ОБУЧЕНИЕ": "EDUCATION",
    "КОНТАКТЫ": "CONTACTS",
    "Привет, я Матвей!": "Hi, I'm Matvey!",
    "Фронтенд разработчик": "Frontend developer",
    "с 2-х летнем опытом.": "with 2 years of experience.",
    "Проекты": "Projects",
    "Навыки": "Skills",
    "Короткий язык": "Ru",
    "Подробнее": "More details",
    "Обучение": "Education",
    "Контакты": "Contacts",
    "Сайт превью": "Preview site",
    "Форум со статьями": "Forum with articles",
    "Интернет магазин самокатов": "Online scooter store",
    "Список задач": "List of tasks",
    "Конфигурация": "Configuration",
    "Архитектура": "Architecture",
    "Оптимизация": "Optimization",
    "Тестирование": "Testing",
    "Линтинг": "Linting",
    "GitHub, CI/CD отчеты": "GitHub, CI/CD reports",
    "Написание скриптов/работа с AST деревом": "Writing scripts/working with AST tree",
    "Работа с данными/запросами": "Working with data/queries",
    "Деплой": "Deploy",
    "Общee": "General",
    "Настройка React, TypeScript, Babel, scss, css module.": "Setting up React, TypeScript, Babel, scss, css module.",
    "Декомпозиция конфига.": "Config decomposition.",
    "Переменные окружения и глобальные переменные.": "Environment variables and global variables.",
    "Вынос проверки типов в отдельный процесс.": "Moving type checking into a separate process.",
    "Svg/svgr loader, babel loader, cache loader, написание кастомных loader.": "Svg/svgr loader, babel loader, cache loader, writing custom loader.",
    "Избавление от кольцевых зависимостей.": "Getting rid of circular dependencies.",
    "React portal, Error Boundaries, кастомные хуки (useHover, useAction, useModal, useInfinitiScroll, useDebounce, useThrottle).": "React portal, Error Boundaries, custom hooks (useHover, useAction, useModal, useInfinitiScroll, useDebounce, useThrottle).",
    "Роли пользователей, приватные роуты.": "User roles, private routes.",
    "Конфигурация роутинга.": "Routing configuration.",
    "Поддержка нескольких языков с помощью i18n.": "Multi-language support with i18n.",
    "Валидация форм, Skeleton, пагинация, observer api, семантика.": "Form validation, Skeleton, pagination, observer api, semantics.",
    "Адаптивная верстка.": "Adaptive layout.",
    "Написание кастомных UI систем таких как: page, tabs, scroll bar, dropdown, listbox, popover, drawer, modal, appImage, вертикальный/горизонталный стек.": "Writing custom UI systems such as: page, tabs, scroll bar, dropdown, listbox, popover, drawer, modal, appImage, vertical/horizontal stack.",
    "Использование headless библиотек.": "Using headless libraries.",
    "Несколько цветовых тем, с быстрым внедрением новой темы.": "Several color themes, with quick introduction of a new theme.",
    "Отступы по UI.": "Indentations by UI.",
    "User agent для отображения мобильной или компьютерной версии приложения.": "User agent to display the mobile or desktop version of the application.",
    "Bootstrap, antd, swipper, framer, toastify, react-toolbar, tsparticles и др.": "Bootstrap, antd, swipper, framer, toastify, react-toolbar, tsparticles, etc.",
    "Концепция features sliced design, module, декомпозиция, бизнес сущности, слабое зацепление, переиспользованность.": "Concept features sliced ​​design, module, decomposition, business entities, loose coupling, reuse.",
    "Концепция виртуальных списков. Избавление от лишних перерисовок: memo, use callback/memo, тротлинг, дебаунс.": "Virtual lists concept. Getting rid of unnecessary redraws: memo, use callback/memo, throttling, debounce.",
    "Уменьшение размера бандла с помощью: динамического импорта библиотек, асинхронных страниц и редусеров, отложенная подгрузка переводов.": "Reducing the bundle size using: dynamic import of libraries, asynchronous pages and reducers, lazy loading of translations.",
    "Настройка списка браузеров в babel.": "Setting up a list of browsers in babel.",
    "Регрессионное тестирование интерфейса: storybook, loki, gargone.": "Interface regression testing: storybook, loki, gargone.",
    "Настройка тестовой среды для: jest,storybook (декораторы, addon theme, addon mock, update), cypress (mock, fixture, stabs, interceptor).": "Setting up a test environment for: jest, storybook (decorators, addon theme, addon mock, update), cypress (mock, fixture, stabs, interceptor).",
    "Написание тестов unit тестов: async thunk, selectors, slice, react component, router, вспомогательные функции.": "Writing unit tests: async thunk, selectors, slice, react component, router, auxiliary functions.",
    "e2e: testing router, тестирование страниц и компонентов.": "e2e: testing router, testing pages and components.",
    "Тестирование кастомных eslint plugin.": "Testing custom eslint plugins.",
    "Настройка: eslint, stylelint, prettier.": "Settings: eslint, stylelint, prettier.",
    "Написание кастомных eslint плагинов (micromath, автофикс).": "Writing custom eslint plugins (micromath, autofix).",
    "Проверка линтером только измененных компонентов - lint stager.": "Linter checks only changed components - lint stager.",
    "CI Pipeline, разбиение job.": "CI Pipeline, job partitioning.",
    "Генерация репорта для скриншотных и unit тестов.": "Generating reports for screenshot and unit tests.",
    "Модульное ветвление: thunk based, git flow.": "Modular branching: thunk based, git flow.",
    "Скрипт для: генерации фичей, деплоя проекта, рефакторинга кода, удаления старых фичей (оптимизация рефакторинга).": "Script for: feature generation, project deployment, code refactoring, removal of old features (refactoring optimization).",
    "Написание babel plugin для редактирования кода при сборки.": "Writing a babel plugin for editing code during assembly.",
    "Работа с node AST (ts-morph).": "Work with node AST (ts-morph).",
    "Написание 3-х кастомных eslint plugin (public api import, layer import, path-checker).": "Writing 3 custom eslint plugins (public api import, layer import, path-checker).",
    "Нормализация данных.": "Data Normalization.",
    "Redux-toolkit: slice, reducers, asynk thunk, reducer manager, entity adapter, mounted reducer, UI state(сохранение позиции скрола), reducer group.": "Redux-toolkit: slice, reducers, asynk thunk, reducer manager, entity adapter, mounted reducer, UI state (saving scroll position), reducer group.",
    "Настройка облачного сервера, SSH, nginx (gzip, pm2).": "Cloud server setup, SSH, nginx (gzip, pm2).",
    "Проксирование запросов, ssl сертификат, https, доменное имя, написание скрипта для деплоя.": "Proxying requests, ssl certificate, https, domain name, writing a script for deployment.",
    "Работа по правилам REST API.": "Work according to REST API rules.",
    "Дебаг (network, application, redux/react devtools и др).": "Debug (network, application, redux/react devtools, etc.).",
    "Написание документации.": "Writing documentation.",
    "Кастомные npm пакеты.": "Custom npm packages.",
    "Работа с dom нодами.": "Working with dom nodes.",
    "SEO оптимизация.": "SEO optimization.",
    "Верстка согласно с макетом.": "The layout is in accordance with the layout.",
    "Отлично владею JavaScript, TypeScript.": "Excellent command of JavaScript, TypeScript.",
    "Навыки адаптивной и кроcсбраузерной верстки.": "Responsive and cross-browser coding skills.",
    "Знание принцепов ООП.": "Knowledge of OOP principles.",
    "Глубокое пониманимание асинхронности в js.": "Deep understanding of asynchrony in js.",
    "Уверенно чувствую себя в экосистеме node js.": "I feel confident in the node js ecosystem.",
    "Написать кастомных лоадеров для оптимизации специфических процессов.": "Write custom loaders to optimize specific processes.",
    "Знание методов оптимизации скорости загрузки сайтов.": "Knowledge of methods for optimizing website loading speed."
}
